// See https://aka.ms/new-console-template for more information
// Задача 2: Напишите программу, которая на вход принимает два числа и выдает, какое число большее, а какое меньшее.
Console.WriteLine("введите 2 числа");
int a = int.Parse(Console.ReadLine());
int b = int.Parse(Console.ReadLine());
if (a>b)
{Console.WriteLine(a);}
else 
{Console.WriteLine(b);}
